/*назви полів 0222-1
'template'
'organization_code'
'organization'
'status'
'timestamp'
'last_update'
'Найменування_забруднюючих_речовин_і_парникових_газів'
'Коди_забруднюючих_речовин_і_парникових_газів'
'Кількість_викинутих_в_атмосферне_повітря_забруднюючих_речовин_і_парникових_газів'
'Розподіл'*/

/*назви полів 0222-2
template
organization code
organization
status
timestamp
last update
Найменування категорій джерел викидів
Код рядка
Кількість сірки діоксиду
Кількість діоксиду  азоту
Кількість оксиду  вуглецю
Кількість неметанових летких  органічних сполук
Кількість поліароматичних  вуглеводнів
Кількість гексахлор-бензолу
Кількість діоксинів і фуранів
Кількість Тч2.5
Кількість Тч10
Кількість аміак
Кількість ртуті
Кількість кадмію
Кількість свинцю
Кількість арсену
Кількість хрому
Кількість міді
Кількість нікелю
Кількість селену
Кількість цинку
    */

INSERT INTO [db_archive].[0222].[input_fields_list] VALUES
(1,'[0222].[form_1].[Title]','template','text', dbo.get_field_name('template')),
(2,'[0222].[form_1].[Title]','organization_code','text', dbo.get_field_name('organization_code')),
(3,'[0222].[form_1].[Title]','organization','text', dbo.get_field_name('organization ')),
(4,'[0222].[form_1].[Title]','status','text', dbo.get_field_name('status ')),
(5,'[0222].[form_1].[Title]','timestamp','datetime', dbo.get_field_name('timestamp ')),
(6,'[0222].[form_1].[Title]','last_update','datetime', dbo.get_field_name('last_update ')),
(7,'[0222].[form_1].[Title]','Найменування','text', dbo.get_field_name('Найменування ')),
(8,'[0222].[form_1].[Title]','Фактична_адреса','text', dbo.get_field_name('Фактична_адреса ')),
(9,'[0222].[form_1].[Title]','Юридична_адреса','text', dbo.get_field_name('Юридична_адреса ')),
(10,'[0222].[form_1].[Title]','ЄДРПОУ','text', dbo.get_field_name('ЄДРПОУ')),
( 11, '[0222].[form_1].[Rozdil1]', 'template', 'text', dbo.get_field_name('template')),
( 12, '[0222].[form_1].[Rozdil1]', 'organization_code', 'code', dbo.get_field_name('organization_code')),
( 13, '[0222].[form_1].[Rozdil1]', 'organization', 'text', dbo.get_field_name('organization')),
( 14, '[0222].[form_1].[Rozdil1]', 'status', 'text', dbo.get_field_name('status')),
( 15, '[0222].[form_1].[Rozdil1]', 'timestamp', 'datetime', dbo.get_field_name('timestamp')),
( 16, '[0222].[form_1].[Rozdil1]', 'last_update', 'datetime', dbo.get_field_name('last_update')),
( 17, '[0222].[form_1].[Rozdil1]', 'Найменування_забруднюючих_речовин_і_парникових_газів', 'text', dbo.get_field_name('Найменування_забруднюючих_речовин_і_парникових_газів')),
( 18, '[0222].[form_1].[Rozdil1]', 'Коди_забруднюючих_речовин_і_парникових_газів', 'code', dbo.get_field_name('Коди_забруднюючих_речовин_і_парникових_газів')),
( 19, '[0222].[form_1].[Rozdil1]', 'Кількість_викинутих_в_атмосферне_повітря_забруднюючих_речовин_і_парникових_газів', 'тон', dbo.get_field_name('Кількість_викинутих_в_атмосферне_повітря_забруднюючих_речовин_і_парникових_газів')),
( 20, '[0222].[form_1].[Rozdil1]', 'Розподіл', 'text', dbo.get_field_name('Розподіл')),
( 21, '[0222].[form_1].[Rozdil2]', 'template', 'text', dbo.get_field_name('template')),
( 22, '[0222].[form_1].[Rozdil2]', 'organization code', 'code', dbo.get_field_name('organization code')),
( 23, '[0222].[form_1].[Rozdil2]', 'organization', 'text', dbo.get_field_name('organization')),
( 24, '[0222].[form_1].[Rozdil2]', 'status', 'text', dbo.get_field_name('status')),
( 25, '[0222].[form_1].[Rozdil2]', 'timestamp', 'datetime', dbo.get_field_name('timestamp')),
( 26, '[0222].[form_1].[Rozdil2]', 'last update', 'datetime', dbo.get_field_name('last update')),
( 27, '[0222].[form_1].[Rozdil2]', 'Найменування категорій джерел викидів', 'text', dbo.get_field_name('Найменування категорій джерел викидів')),
( 28, '[0222].[form_1].[Rozdil2]', 'Код рядка', 'code', dbo.get_field_name('Код рядка')),
( 29, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками сірки діоксид', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками сірки діоксид')),
( 30, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками діоксид азоту', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками діоксид азоту')),
( 31, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками оксид вуглецю', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками оксид вуглецю')),
( 32, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками неметанові леткі органічні сполуки', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками неметанові леткі органічні сполуки')),
( 33, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками поліароматичні вуглеводні', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками поліароматичні вуглеводні')),
( 34, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками гексахлорбензол', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками гексахлорбензол')),
( 35, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками діоксини і фурани', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками діоксини і фурани')),
( 36, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками Тч2.5', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками Тч2.5')),
( 37, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками Тч10', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками Тч10')),
( 38, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками аміак', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками аміак')),
( 39, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками ртуть', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками ртуть')),
( 40, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками кадмій', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками кадмій')),
( 41, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками свинець', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками свинець')),
( 42, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками арсен', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками арсен')),
( 43, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками хром', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками хром')),
( 44, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками мідь', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками мідь')),
( 45, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками нікель', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками нікель')),
( 46, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками селен', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками селен')),
( 47, '[0222].[form_1].[Rozdil2]', 'Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками цинк', 'тон', dbo.get_field_name('Кількість викинутих в атмосферне повітря забруднюючих речовин, тонн, з трьома десятковими знаками цинк'))






CREATE TABLE [db_archive].[0222].[rozdil1](
F_1344633181 NVARCHAR(MAX) NOT NULL,
F_335755275 NVARCHAR(MAX) NOT NULL,
F_1553510724 NVARCHAR(MAX) NOT NULL,
F450546908 NVARCHAR(MAX) NOT NULL,
F_147495489 DATETIME NOT NULL,
F_746347891 DATETIME NOT NULL,
F462598570 NVARCHAR(MAX) NOT NULL,
F_648332651 NVARCHAR(50) NOT NULL,
F1683357075 DECIMAL(18,3) NULL,
F_1372077549  NVARCHAR(MAX) NULL
)
GO

INSERT INTO [0222].[form_1].[Rozdil1](

F_1344633181,
F_335755275,
F_1553510724,
F450546908,
F_147495489,
F_746347891,
F462598570,
F_648332651,
F1683357075,
F_1372077549

)
/******

USE [GZ_Arh]
GO

 Object:  Table [dbo].[0222 - 1]    Script Date: 26.09.2022 13:06:26 
SET ANSI_NULLS ON
GO

SET QUOTED_IDENTIFIER ON
GO

CREATE TABLE [dbo].[0222 - 1](
	[template] [nvarchar](50) NOT NULL,
	[organization_code] [nvarchar](50) NOT NULL,
	[organization] [nvarchar](50) NOT NULL,
	[status] [nvarchar](50) NOT NULL,
	[timestamp] [datetime2](7) NOT NULL,
	[last_update] [datetime2](7) NOT NULL,
	[Найменування_забруднюючих_речовин_і_парникових_газів] [nvarchar](100) NULL,
	[Коди_забруднюючих_речовин_і_парникових_газів] [nvarchar](50) NULL,
	[Кількість_викинутих_в_атмосферне_повітря_забруднюючих_речовин_і_парникових_газів] [decimal](18, 3) NULL,
	[Розподіл] [nvarchar](50) NULL
) ON [PRIMARY]
GO


USE [GZ_Arh]
GO

/****** Object:  Table [dbo].[0222 - 2]    Script Date: 26.09.2022 13:07:40 
SET ANSI_NULLS ON
GO

SET QUOTED_IDENTIFIER ON
GO

CREATE TABLE [dbo].[0222 - 2](
	[template] [nvarchar](255) NULL,
	[organization code] [nvarchar](255) NULL,
	[organization] [nvarchar](255) NULL,
	[status] [nvarchar](255) NULL,
	[timestamp] [datetime] NULL,
	[last update] [datetime] NULL,
	[Найменування категорій джерел викидів] [nvarchar](255) NULL,
	[Код рядка] [nvarchar](255) NULL,
	[Кількість сірки діоксиду] [decimal](10, 3) NULL,
	[Кількість діоксиду  азоту] [decimal](10, 3) NULL,
	[Кількість оксиду  вуглецю] [decimal](10, 3) NULL,
	[Кількість неметанових летких  органічних сполук] [decimal](10, 3) NULL,
	[Кількість поліароматичних  вуглеводнів] [decimal](10, 3) NULL,
	[Кількість гексахлор-бензолу] [decimal](10, 3) NULL,
	[Кількість діоксинів і фуранів] [decimal](10, 3) NULL,
	[Кількість Тч2.5] [decimal](10, 3) NULL,
	[Кількість Тч10] [decimal](10, 3) NULL,
	[Кількість аміак] [decimal](10, 3) NULL,
	[Кількість ртуті] [decimal](10, 3) NULL,
	[Кількість кадмію] [decimal](10, 3) NULL,
	[Кількість свинцю] [decimal](10, 3) NULL,
	[Кількість арсену] [decimal](10, 3) NULL,
	[Кількість хрому] [decimal](10, 3) NULL,
	[Кількість міді] [decimal](10, 3) NULL,
	[Кількість нікелю] [decimal](10, 3) NULL,
	[Кількість селену] [decimal](10, 3) NULL,
	[Кількість цинку] [decimal](10, 3) NULL
) ON [PRIMARY]
GO
******/